OpenFOAM/OpenFOAM-5.x/tutorials/multiphase/interFoam/LES/nozzleFlow2D/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

set             c0;

coordinateSystem global;

globalCoeffs
{
    tan1            (1 0 0);
    tan2            (0 1 0);
}

patchLocalCoeffs
{
    patch           outside;
    tan1            (1 0 0);
}

directions      ( tan1 );

useHexTopology  no;

geometricCut    yes;

writeMesh       no;


// ************************************************************************* //
